name_session = "bot"
TOKEN = 
api_id = 
api_hash = 

admins = []

prefix = '!'
chat_dp_id = 
channel_dp_id = 

ref_links = {1: "Спасибо что присойденилися к нашему проекту с сайта Информатор",
             2: "Спасибо что присойденилися к нашему проекту с телеграмм Канала Информатор.",
             3: "Спасибо что присойденилися к нашему проекту с Facebook  Информатор",
             4: "Спасибо что присойденилися к нашему проекту с Facebook Днепр сейчас",
             5: "Спасибо что присойденилися к нашему проекту с Viber информатор"}
